Tekla.Structures.Drawing.DotPrintScalingType
The print scaling type.

Tekla.Structures.Drawing.DotPrintScalingType.Auto
Auto scale.

Tekla.Structures.Drawing.DotPrintScalingType.Scale
Use defined scale.